Python 3.10.5 (tags/v3.10.5:f377153, Jun  6 2022, 16:14:13) [MSC v.1929 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

============ RESTART: C:\Users\ASUS\Desktop\Python progs\X and O.py ============
Я хочу сыграть с тобой в одну игру... "Крестики-Нолики"!
Каким знаком ходишь? (X или 0)
X
Первым ходит... игрок

   |   |  
---+---+---
   |   |  
---+---+---
   |   |  
Ваш ход (1-9):
5
   |   |  
---+---+---
   | X |  
---+---+---
 0 |   |  
Ваш ход (1-9):
6
   |   |  
---+---+---
 0 | X | X
---+---+---
 0 |   |  
Ваш ход (1-9):
7
 X |   |  
---+---+---
 0 | X | X
---+---+---
 0 |   | 0
Ваш ход (1-9):
2
 X | 0 |  
---+---+---
 0 | X | X
---+---+---
 0 | X | 0
Ваш ход (1-9):
9
 X | 0 | X
---+---+---
 0 | X | X
---+---+---
 0 | X | 0
Ничья. в следующий раз повезёт
Есть желание сыграть снова? (да или нет)
да
Каким знаком ходишь? (X или 0)
X
Первым ходит... игрок

   |   |  
---+---+---
   |   |  
---+---+---
   |   |  
Ваш ход (1-9):
5
   |   |  
---+---+---
   | X |  
---+---+---
 0 |   |  
Ваш ход (1-9):
5
Ваш ход (1-9):
5
Ваш ход (1-9):
4
   |   |  
---+---+---
 X | X | 0
---+---+---
 0 |   |  
Ваш ход (1-9):
8
   | X |  
---+---+---
 X | X | 0
---+---+---
 0 | 0 |  
Ваш ход (1-9):
3
 0 | X |  
---+---+---
 X | X | 0
---+---+---
 0 | 0 | X
Ваш ход (1-9):
9
 0 | X | X
---+---+---
 X | X | 0
---+---+---
 0 | 0 | X
Ничья. в следующий раз повезёт
Есть желание сыграть снова? (да или нет)
да
Каким знаком ходишь? (X или 0)
x
Первым ходит... игрок

   |   |  
---+---+---
   |   |  
---+---+---
   |   |  
Ваш ход (1-9):
4
   |   |  
---+---+---
 X |   |  
---+---+---
 0 |   |  
Ваш ход (1-9):
5
   |   |  
---+---+---
 X | X | 0
---+---+---
 0 |   |  
Ваш ход (1-9):
2
   | 0 |  
---+---+---
 X | X | 0
---+---+---
 0 | X |  
Ваш ход (1-9):
1
Ваш ход (1-9):
45
Ваш ход (1-9):
213
Ваш ход (1-9):
42
Ваш ход (1-9):
1
Ваш ход (1-9):
7
 X | 0 |  
---+---+---
 X | X | 0
---+---+---
 0 | X | 0
Ваш ход (1-9):
3
Ваш ход (1-9):
7
Ваш ход (1-9):
9
 X | 0 | X
---+---+---
 X | X | 0
---+---+---
 0 | X | 0
Ничья. в следующий раз повезёт
Есть желание сыграть снова? (да или нет)
да
Каким знаком ходишь? (X или 0)
0
Первым ходит... компьютер

   |   |  
---+---+---
   | X |  
---+---+---
   |   |  
Ваш ход (1-9):
1
   | X |  
---+---+---
   | X |  
---+---+---
 0 |   |  
Ваш ход (1-9):
4
   | X |  
---+---+---
 0 | X |  
---+---+---
 0 | X |  
Компьютер победил! Сочувствую...
   | X |  
---+---+---
 0 | X | X
---+---+---
 0 | X |  
Компьютер победил! Сочувствую...
Traceback (most recent call last):
  File "C:\Users\ASUS\Desktop\Python progs\X and O.py", line 112, in <module>
    makeMove(theBoard, computerLetter, move)
  File "C:\Users\ASUS\Desktop\Python progs\X and O.py", line 26, in makeMove
    board[move] = letter
TypeError: list indices must be integers or slices, not NoneType

====================================================== RESTART: C:\Users\ASUS\Desktop\Python progs\X and O.py =====================================================
Я хочу сыграть с тобой в одну игру... "Крестики-Нолики"!
Каким знаком ходишь? (X или 0)
---+---+---X
Каким знаком ходишь? (X или 0)
X
Первым ходит... компьютер

   |   |  
---+---+---
   |   |  
---+---+---
   |   | 0
Ваш ход (1-9):
1
   |   | 0
---+---+---
   |   |  
---+---+---
 X |   | 0
Ваш ход (1-9):
2
   |   | 0
---+---+---
   |   | 0
---+---+---
 X | X | 0
Компьютер победил! Сочувствую...
Есть желание сыграть снова? (да или нет)
да
Каким знаком ходишь? (X или 0)
0
Первым ходит... игрок

   |   |  
---+---+---
   |   |  
---+---+---
   |   |  
Ваш ход (1-9):
1
   |   |  
---+---+---
   | X |  
---+---+---
 0 |   |  
Ваш ход (1-9):
4
   |   |  
---+---+---
 0 | X |  
---+---+---
 0 | X |  
Ваш ход (1-9):
7
 0 |   |  
---+---+---
 0 | X |  
---+---+---
 0 | X |  
Поздравляю с победой!
Есть желание сыграть снова? (да или нет)
да
Каким знаком ходишь? (X или 0)
